Mmatsnev/hc32f4a0/DeviceDriverLibrary/hc32f4a0_ddl/driver/inc/hc32f4a0_usb_otg_regs.h
/**
 *******************************************************************************
 * @file  hc32f4a0_usb_otg_regs.h
 * @brief A detailed description is available at hardware registers
 *        
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Wangmin         First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

#ifndef __HC32F4A0_USB_OTG_REGS_H__
#define __HC32F4A0_USB_OTG_REGS_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include <stdint.h>
#include "usb_conf.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @addtogroup DDL_USB_OTG
 * @{
 */

#if (DDL_USBFS_ENABLE == DDL_ON)

/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup USB_OTG_REGS_Global_Macros USB OTG REGS Global Macros
 * @{
 */

#ifndef __IO
    #define     __IO    volatile
#endif

#define USB_OTG_HS_BASE_ADDR                 (0x400C0000UL)
#define USB_OTG_FS_BASE_ADDR                 (0x40080000UL)

#define USB_OTG_CORE_GLOBAL_REGS_OFFSET      (0x000U)
#define USB_OTG_DEV_GLOBAL_REG_OFFSET        (0x800U)
#define USB_OTG_DEV_IN_EP_REG_OFFSET         (0x900U)
#define USB_OTG_EP_REG_OFFSET                (0x20U)
#define USB_OTG_DEV_OUT_EP_REG_OFFSET        (0xB00U)
#define USB_OTG_HOST_GLOBAL_REG_OFFSET       (0x400U)
#define USB_OTG_HOST_PORT_REGS_OFFSET        (0x440U)
#define USB_OTG_HOST_CHAN_REGS_OFFSET        (0x500U)
#define USB_OTG_CHAN_REGS_OFFSET             (0x20U)
#define USB_OTG_PCGCCTL_OFFSET               (0xE00U)
#define USB_OTG_DATA_FIFO_OFFSET             (0x1000U)
#define USB_OTG_DATA_FIFO_SIZE               (0x1000U)


#define USB_OTG_MAX_TX_FIFOS                 (16U)

#define USB_OTG_HS_MAX_PACKET_SIZE           (512U)
#define USB_OTG_FS_MAX_PACKET_SIZE           (64U)
#define USB_OTG_MAX_EP0_SIZE                 (64U)
/**
 * @}
 */

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup USB_OTG_REGS_Global_Types USB OTG REGS Global Types
 * @{
 */
typedef struct//000h
{
    __IO uint32_t GOTGCTL;      /* USB_OTG Control and Status Register    000h*/
    __IO uint32_t GOTGINT;      /* USB_OTG Interrupt Register             004h*/
    __IO uint32_t GAHBCFG;      /* Core AHB Configuration Register    008h*/
    __IO uint32_t GUSBCFG;      /* Core USB Configuration Register    00Ch*/
    __IO uint32_t GRSTCTL;      /* Core Reset Register                010h*/
    __IO uint32_t GINTSTS;      /* Core Interrupt Register            014h*/
    __IO uint32_t GINTMSK;      /* Core Interrupt Mask Register       018h*/
    __IO uint32_t GRXSTSR;      /* Receive Sts Q Read Register        01Ch*/
    __IO uint32_t GRXSTSP;      /* Receive Sts Q Read & POP Register  020h*/
    __IO uint32_t GRXFSIZ;      /* Receive FIFO Size Register         024h*/
    __IO uint32_t GNPTXFSIZ;    /* EP0 / Non Periodic Tx FIFO Size Register 028h*/
    __IO uint32_t GNPTXSTS;     /* Non Periodic Tx FIFO/Queue Sts reg 02Ch*/
    __IO uint32_t GI2CCTL;      /*  reg 030h*/
    __IO uint32_t GPVNDCTL;     /*  reg 034h*/
    __IO uint32_t GGPIO;        /* General Purpose IO Register        038h*/
    __IO uint32_t GUID;         /* User ID Register                   03Ch*/
    uint32_t  Reserved40[48];   /* Reserved                      040h-0FFh*/
    __IO uint32_t HPTXFSIZ;     /* Host Periodic Tx FIFO Size Reg     100h*/
    __IO uint32_t DPTXFSIZ[USB_OTG_MAX_TX_FIFOS];/* dev Periodic Transmit FIFO */
}USB_OTG_GREGS;

