Mmatsnev/hc32f4a0/DeviceDriverLibrary/hc32f4a0_ddl/driver/inc/hc32f4a0_usb_otg_regs.h
typedef struct// 800h
{
    volatile uint32_t DCFG;      /* dev Configuration Register   800h*/
    volatile uint32_t DCTL;      /* dev Control Register         804h*/
    volatile uint32_t DSTS;      /* dev Status Register (RO)     808h*/
    uint32_t Reserved0C;         /* Reserved                     80Ch*/
    volatile uint32_t DIEPMSK;   /* dev IN Endpoint Mask         810h*/
    volatile uint32_t DOEPMSK;   /* dev OUT Endpoint Mask        814h*/
    volatile uint32_t DAINT;     /* dev All Endpoints Itr Reg    818h*/
    volatile uint32_t DAINTMSK;  /* dev All Endpoints Itr Mask   81Ch*/
    uint32_t  Reserved20;        /* Reserved                     820h*/
    uint32_t Reserved9;          /* Reserved                     824h*/
    volatile uint32_t DVBUSDIS;  /* dev VBUS discharge Register  828h*/
    volatile uint32_t DVBUSPULSE;/* dev VBUS Pulse Register      82Ch*/
    volatile uint32_t DTHRCTL;   /* dev thr                      830h*/
    volatile uint32_t DIEPEMPMSK;/* dev empty msk                834h*/
    volatile uint32_t DEACHINT;  /* dedicated EP interrupt       838h*/
    volatile uint32_t DEACHMSK;  /* dedicated EP msk             83Ch*/
}USB_OTG_DREGS;

typedef struct
{
    volatile uint32_t DIEPCTL; /* dev IN Endpoint Control Reg 900h + (ep_num * 20h) + 00h*/
    uint32_t Reserved04;       /* Reserved                       900h + (ep_num * 20h) + 04h*/
    volatile uint32_t DIEPINT; /* dev IN Endpoint Itr Reg     900h + (ep_num * 20h) + 08h*/
    uint32_t Reserved0C;       /* Reserved                       900h + (ep_num * 20h) + 0Ch*/
    volatile uint32_t DIEPTSIZ;/* IN Endpoint Txfer Size   900h + (ep_num * 20h) + 10h*/
    volatile uint32_t DIEPDMA; /* IN Endpoint DMA Address Reg    900h + (ep_num * 20h) + 14h*/
    volatile uint32_t DTXFSTS; /* IN Endpoint Tx FIFO Status Reg 900h + (ep_num * 20h) + 18h*/
    uint32_t Reserved18;       /* Reserved  900h+(ep_num*20h)+1Ch-900h+ (ep_num * 20h) + 1Ch*/
}USB_OTG_INEPREGS;

typedef struct
{
    volatile uint32_t DOEPCTL;   /* dev OUT Endpoint Control Reg  B00h + (ep_num * 20h) + 00h*/
    uint32_t Reserved04;         /* Reserved                      B00h + (ep_num * 20h) + 04h*/
    volatile uint32_t DOEPINT;   /* dev OUT Endpoint Itr Reg      B00h + (ep_num * 20h) + 08h*/
    uint32_t Reserved0C;         /* Reserved                      B00h + (ep_num * 20h) + 0Ch*/
    volatile uint32_t DOEPTSIZ;  /* dev OUT Endpoint Txfer Size   B00h + (ep_num * 20h) + 10h*/
    volatile uint32_t DOEPDMA;   /* dev OUT Endpoint DMA Address  B00h + (ep_num * 20h) + 14h*/
    uint32_t Reserved18[2];      /* Reserved B00h + (ep_num * 20h) + 18h - B00h + (ep_num * 20h) + 1Ch*/
}USB_OTG_OUTEPREGS;

typedef struct
{
    volatile uint32_t HCFG;      /* Host Configuration Register    400h*/
    volatile uint32_t HFIR;      /* Host Frame Interval Register   404h*/
    volatile uint32_t HFNUM;     /* Host Frame Nbr/Frame Remaining 408h*/
    uint32_t Reserved40C;        /* Reserved                       40Ch*/
    volatile uint32_t HPTXSTS;   /* Host Periodic Tx FIFO/ Queue Status 410h*/
    volatile uint32_t HAINT;     /* Host All Channels Interrupt Register 414h*/
    volatile uint32_t HAINTMSK;  /* Host All Channels Interrupt Mask 418h*/
}USB_OTG_HREGS;

typedef struct
{
    volatile uint32_t HCCHAR;
    volatile uint32_t HCSPLT;
    volatile uint32_t HCINT;
    volatile uint32_t HCINTMSK;
    volatile uint32_t HCTSIZ;
    volatile uint32_t HCDMA;
    uint32_t Reserved[2];
}USB_OTG_HC_REGS;

typedef struct//000h
{
    USB_OTG_GREGS         *GREGS;
    USB_OTG_DREGS         *DREGS;
    USB_OTG_HREGS         *HREGS;
    USB_OTG_INEPREGS      *INEP_REGS[USB_OTG_MAX_TX_FIFOS];
    USB_OTG_OUTEPREGS     *OUTEP_REGS[USB_OTG_MAX_TX_FIFOS];
    USB_OTG_HC_REGS       *HC_REGS[USB_OTG_MAX_TX_FIFOS];
    volatile uint32_t     *HPRT0;
    volatile uint32_t     *DFIFO[USB_OTG_MAX_TX_FIFOS];
    volatile uint32_t     *PCGCCTL;
}USB_OTG_CORE_REGS , *PUSB_OTG_CORE_REGS;

typedef union _USB_OTG_GOTGCTL_TypeDef
{
    uint32_t d32;
    struct
    {
        unsigned sesreqscs:1;
        unsigned sesreq:1;
        unsigned vbvalidoven:1;
        unsigned vbvalidovval:1;
        unsigned avalidoven:1;
        unsigned avalidovval:1;
        unsigned bvalidoven:1;
        unsigned bvalidovval:1;
        unsigned hstnegscs:1;
        unsigned hnpreq:1;
        unsigned hstsethnpen:1;
        unsigned devhnpen:1;
        unsigned reserved12_15:4;
        unsigned conidsts:1;
        unsigned dbnctime:1;
        unsigned asesvld:1;
        unsigned bsesvld:1;
        unsigned otgver:1;
        unsigned reserved1:1;
        unsigned multvalidbc:5;
        unsigned chirpen:1;
        unsigned reserved28_31:4;
    }
    b;
} USB_OTG_GOTGCTL_TypeDef ;

typedef union _USB_OTG_GOTGINT_TypeDef
{
    uint32_t d32;
    struct
    {
        /** Current Mode */
        unsigned reserved0_1:2;

        /** Session End Detected */
        unsigned sesenddet:1;

        unsigned reserved3_7:5;

        /** Session Request Success Status Change */
        unsigned sesreqsucstschng:1;
        /** Host Negotiation Success Status Change */
        unsigned hstnegsucstschng:1;

        unsigned reserved10_16:7;

        /** Host Negotiation Detected */
        unsigned hstnegdet:1;
        /** A-Device Timeout Change */
        unsigned adevtoutchng:1;
        /** Debounce Done */
        unsigned debdone:1;
        /** Multi-Valued input changed */
        unsigned mvic:1;

        unsigned reserved31_21:11;
    }
    b;
} USB_OTG_GOTGINT_TypeDef ;
typedef union _USB_OTG_GAHBCFG_TypeDef
{
    uint32_t d32;
    struct
    {
        unsigned glblintrmsk:1;
#define DWC_GAHBCFG_GLBINT_ENABLE           (1U)

        unsigned hburstlen:4;
#define DWC_GAHBCFG_INT_DMA_BURST_SINGLE    (0U)
#define DWC_GAHBCFG_INT_DMA_BURST_INCR      (1U)
#define DWC_GAHBCFG_INT_DMA_BURST_INCR4     (3U)
#define DWC_GAHBCFG_INT_DMA_BURST_INCR8     (5U)
#define DWC_GAHBCFG_INT_DMA_BURST_INCR16    (7U)

        unsigned dmaenable:1;
#define DWC_GAHBCFG_DMAENABLE               (1U)
        unsigned reserved:1;
        unsigned nptxfemplvl_txfemplvl:1;
        unsigned ptxfemplvl:1;
#define DWC_GAHBCFG_TXFEMPTYLVL_EMPTY       (1U)
#define DWC_GAHBCFG_TXFEMPTYLVL_HALFEMPTY   (0U)
        unsigned reserved9_20:12;
        unsigned remmemsupp:1;
        unsigned notialldmawrit:1;
        unsigned ahbsingle:1;
        unsigned reserved24_31:8;
  }
  b;
} USB_OTG_GAHBCFG_TypeDef ;

typedef union _USB_OTG_GUSBCFG_TypeDef
{
    uint32_t d32;
    struct
    {
        unsigned toutcal:3;
        unsigned phyif:1;
        unsigned ulpi_utmi_sel:1;
        unsigned fsintf:1;
        unsigned physel:1;
        unsigned ddrsel:1;
        unsigned srpcap:1;
        unsigned hnpcap:1;
        unsigned usbtrdtim:4;
        unsigned reserved1:1;
        unsigned phylpwrclksel:1;
        unsigned otgutmifssel:1;
        unsigned ulpi_fsls:1;
        unsigned ulpi_auto_res:1;
        unsigned ulpi_clk_sus_m:1;
        unsigned ulpi_ext_vbus_drv:1;
        unsigned ulpi_int_vbus_indicator:1;
        unsigned term_sel_dl_pulse:1;
        unsigned indicator_complement:1;
        unsigned indicator_pass_through:1;
        unsigned ulpi_int_prot_dis:1;
        unsigned ic_usb_cap:1;
        unsigned ic_traffic_pull_remove:1;
        unsigned tx_end_delay:1;
        unsigned force_host_mode:1;
        unsigned force_dev_mode:1;
        unsigned reserved31:1;
    }
    b;
} USB_OTG_GUSBCFG_TypeDef ;

typedef struct
{
    /** Core Soft Reset (CSftRst) (Device and Host)
    *
    * The application can flush the control logic in the
    * entire core using this bit. This bit resets the
    * pipelines in the AHB Clock domain as well as the
    * PHY Clock domain.
    *
    * The state machines are reset to an IDLE state, the
    * control bits in the CSRs are cleared, all the
    * transmit FIFOs and the receive FIFO are flushed.
    *
    * The status mask bits that control the generation of
    * the interrupt, are cleared, to clear the
    * interrupt. The interrupt status bits are not
    * cleared, so the application can get the status of
    * any events that occurred in the core after it has
    * set this bit.
    *
    * Any transactions on the AHB are terminated as soon
    * as possible following the protocol. Any
    * transactions on the USB are terminated immediately.
    *
    * The configuration settings in the CSRs are
    * unchanged, so the software doesn't have to
    * reprogram these registers (Device
    * Configuration/Host Configuration/Core System
    * Configuration/Core PHY Configuration).
    *
    * The application can write to this bit, any time it
    * wants to reset the core. This is a self clearing
    * bit and the core clears this bit after all the
    * necessary logic is reset in the core, which may
    * take several clocks, depending on the current state
    * of the core.
    */
    unsigned csftrst:1;
    /** Hclk Soft Reset
    *
    * The application uses this bit to reset the control logic in
    * the AHB clock domain. Only AHB clock domain pipelines are
    * reset.
    */
    unsigned hsftrst:1;
    /** Host Frame Counter Reset (Host Only)<br>
    *
    * The application can reset the (micro)frame number
    * counter inside the core, using this bit. When the
    * (micro)frame counter is reset, the subsequent SOF
    * sent out by the core, will have a (micro)frame
    * number of 0.
    */
    unsigned hstfrm:1;
    /** In Token Sequence Learning Queue Flush
    * (INTknQFlsh) (Device Only)
    */
    unsigned intknqflsh:1;
    /** RxFIFO Flush (RxFFlsh) (Device and Host)
    *
    * The application can flush the entire Receive FIFO
    * using this bit. The application must first
    * ensure that the core is not in the middle of a
    * transaction. The application should write into
    * this bit, only after making sure that neither the
    * DMA engine is reading from the RxFIFO nor the MAC
    * is writing the data in to the FIFO. The
    * application should wait until the bit is cleared
    * before performing any other operations. This bit
    * will takes 8 clocks (slowest of PHY or AHB clock)
    * to clear.
    */
    unsigned rxfflsh:1;
    /** TxFIFO Flush (TxFFlsh) (Device and Host).
    *
    * This bit is used to selectively flush a single or
    * all transmit FIFOs. The application must first
    * ensure that the core is not in the middle of a
    * transaction. The application should write into
    * this bit, only after making sure that neither the
    * DMA engine is writing into the TxFIFO nor the MAC
    * is reading the data out of the FIFO. The
    * application should wait until the core clears this
    * bit, before performing any operations. This bit
    * will takes 8 clocks (slowest of PHY or AHB clock)
    * to clear.
    */
    unsigned txfflsh:1;

